name = "Василь" # Создайте переменную name и присвойте ей значение вашего имени (строка).
print("Name:", name) # Выведите значение переменной name на экран.
age = 38 # Создайте переменную age и присвойте ей значение вашего возраста (целое число).
print("Age:", str(age)) # Выведите значение переменной age на экран.
# Перезапишите в age текущее значение переменной age + новое.
# Или print("New Age:", str(age+1)) если age оставить далее без изменений
age+=1
print("New Age: "+str(age)) # Выведите измененное значение переменной age на экран.
is_student = True # Создайте переменную is_student и присвойте ей значение True (логическое значение).
print("Is Student:", str(is_student)) # Выведите значение переменной is_student на экран.
